--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀ 
▀▄ ▄▀                                     ▀▄ ▄▀ 
▀▄ ▄▀    BY tetoo                         ▀▄ ▄▀ 
▀▄ ▄▀     BY nmore       (@l_l_lo)        ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY l_l_ll               ▀▄ ▄▀ 
▀▄ ▄▀       broadcast  : help ar          ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀ 
--]]

do
function run(msg, matches)
 if matches[1] == "الاوامر" and is_momod(msg) then
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🌟🔥هـنالك خمسـةة قـوائم الاوامـر
🌟سـورس تيـتو @no_no2 🔥🌟


🕵‍♀👁‍🗨 م1 🌟 لـعـرض الاومـر الـرئسـيةة

🕵‍♀👁‍🗨 م2 🌟 لـعـرض الاومـر التـرقيـةة و الحـظر

🕵‍♀👁‍🗨م3 🌟لـعـرض الاومـر الحمايه

🕵‍♀👁‍🗨م4 🌟لعـرض اومـر تحكم

🕵‍♀👁‍🗨م المـطور  🌟 لعـرض اومـر المـطور

🕵‍♀🌟مـــ๋͜͡ـہٰٰـطـ✮๋͜͡‏ٰ̲ـِـور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@xOx_tema_xOx

🕵‍♀🌟قـﮧ௸ْْـّٰ̐ہٰٰنــ✮๋͜͡‏ٰ̲ـِـاه الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@nO_No2

🕵‍♀🌟بـﮧ௸ْْـّٰ̐ہٰٰوت تــ✮๋͜͡‏ٰ̲ـِـواصـٰٰٖـٰٰٖہـٰٰٖ͡ـہـل
@k3k44_bOt


]]
------------------

  elseif matches[1] == "م1" and is_momod(msg) then
    return "🎀🎖اهـلا بـك عـزيـزي 😻  "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  🔥الاوامـر الـرئسـيه فـي المجـموعه🔥

🕵‍♀👁‍🗨/ايدي 🌟 لعـرض ايديك

🕵‍♀👁‍🗨معلوماتي 🌟 لعرض معلوماتك

🕵‍♀👁‍🗨موقعي 🌟لعرض موقعك

🕵‍♀👁‍🗨معلومات المجموعه 🌟لعرض اوامر مجموعتك 
🕵‍♀👁‍🗨اعدادات المجموعه 🌟 لعرض اعدادات المجموعه

🕵‍♀👁‍🗨الاعدادات 🌟لعرض اعدادات كروب

🕵‍♀👁‍🗨اعدادات الوسائط 🌟لعرض وسائط

🕵‍♀👁‍🗨القـوانين 🌟لعرض قوانين المجموعه

🕵‍♀👁‍🗨الرابط 🌟 لاظهار رابط مجموعه

🕵‍♀👁‍🗨مدير المجموعه 🌟 لعرض المدير

🕵‍♀👁‍🗨الاداريين🌟لعرض ادارين مجموعه

🕵‍♀👁‍🗨الادمنيه 🌟لعرض ادمنيه مجموعه

🕵‍♀👁‍🗨المـطور 🌟 لعـرض مـطور سـورس

🕵‍♀👁‍🗨الاصـدار 🌟 لمعرفه اصدارات سورس



🕵‍♀🌟مـــ๋͜͡ـہٰٰـطـ✮๋͜͡‏ٰ̲ـِـور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@xOx_tema_xOx

🕵‍♀🌟قـﮧ௸ْْـّٰ̐ہٰٰنــ✮๋͜͡‏ٰ̲ـِـاه الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@nO_No2

🕵‍♀🌟بـﮧ௸ْْـّٰ̐ہٰٰوت تــ✮๋͜͡‏ٰ̲ـِـواصـٰٰٖـٰٰٖہـٰٰٖ͡ـہـل
@k3k44_bOt

]]
------------------


  elseif  matches[1] == "م2" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
 🔥اوامــر الـترقية و الحـظر 🔥

🔥تسـتخدم مع المـعرف و ايدي و الـرد

🕵‍♀👁‍🗨رفع ادمـن 🌟 لـرفع العـظو ادمن
🕵‍♀👁‍🗨رفع اداري 🌟 لـترقيه الي اداري 
🕵‍♀👁‍🗨رفع مـدير 🌟لترقيه الـي مدير مجموعه

🕵‍♀👁‍🗨تنـزيل ادمـن 🌟لحـذف من اداره لبوت 
🕵‍♀👁‍🗨تـنزيل اداري 🌟لحذف اداري

🕵‍♀👁‍🗨طرد المحـذوف 🌟 لطرد حاذف حسابه 

🕵‍♀👁‍🗨حـظـر 🌟لحظر العـظو 

🕵‍♀👁‍🗨طـرد 🌟لـطرد العـظو
 
🕵‍♀👁‍🗨حـظر عـام 🌟 احظر عظو من جميع كروبات لبوت
🕵‍♀👁‍🗨الغاء العام 🌟 للغاء الحظر عنه

🕵‍♀👁‍🗨كتم 🌟 لكتـم العـظو
🕵‍♀👁‍🗨كتـم 🌟 للغاء كتـم العـظو 

🕵‍♀👁‍🗨منع كلمه 🌟لمنع كلمه في كـروب
🕵‍♀👁‍🗨الغاء المنـع 🌟لفتح حـظر عـن كلمـة
🕵‍♀👁‍🗨قائمه المنـع 🌟لعـرض كلمات المحظوره



🕵‍♀🌟مـــ๋͜͡ـہٰٰـطـ✮๋͜͡‏ٰ̲ـِـور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@xOx_tema_xOx

🕵‍♀🌟قـﮧ௸ْْـّٰ̐ہٰٰنــ✮๋͜͡‏ٰ̲ـِـاه  الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@nO_No2

🕵‍♀🌟بـﮧ௸ْْـّٰ̐ہٰٰوت تــ✮๋͜͡‏ٰ̲ـِـواصـٰٰٖـٰٰٖہـٰٰٖ͡ـہـل
@k3k44_bOt

]]
------------------

  elseif  matches[1] == "م3" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  
🔥اوامــر الحـمايه🔥

🕵‍♀👁‍🗨للقفـل ☚ قـفـل + الامـر  | 🔖|
🕵‍♀👁‍🗨للفـتح ☚ فتح + الامـر.   |🔖|

🕵‍♀👁‍🗨الـصـوت 
🕵‍♀👁‍🗨الصـور
🕵‍♀👁‍🗨الفيديو
🕵‍♀👁‍🗨الملـصقات 
🕵‍♀👁‍🗨الروابط 
🕵‍♀👁‍🗨التكرار 
🕵‍♀👁‍🗨الاضافه 
🕵‍♀👁‍🗨العربيه
🕵‍♀👁‍🗨دخول برابط
🕵‍♀👁‍🗨الاشعارات
🕵‍♀👁‍🗨التاك 
🕵‍♀👁‍🗨جهات الاتصال
🕵‍♀👁‍🗨العربيه 
🕵‍♀👁‍🗨اعاده توجيه
🕵‍♀👁‍🗨الكلايش 
🕵‍♀👁‍🗨التكرار
🕵‍♀👁‍🗨اعاده توجيـه



🕵‍♀🌟مـــ๋͜͡ـہٰٰـطـ✮๋͜͡‏ٰ̲ـِـور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@xOx_tema_xOx

🕵‍♀🌟قـﮧ௸ْْـّٰ̐ہٰٰنــ✮๋͜͡‏ٰ̲ـِـاه الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@nO_No2

🕵‍♀🌟بـﮧ௸ْْـّٰ̐ہٰٰوت تــ✮๋͜͡‏ٰ̲ـِـواصـٰٰٖـٰٰٖہـٰٰٖ͡ـہـل
@k3k44_bOt


]]
------------------

  elseif  matches[1] == "م4" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻 "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔥قـائمة  تحـكم المجمـوعةة 🔥

🕵‍♀👁‍🗨ضـع صـوره

🕵‍♀👁‍🗨ضـع اسـم

🕵‍♀👁‍🗨ضـع الـرابط

🕵‍♀👁‍🗨ضـع المعـرف
 
🕵‍♀👁‍🗨ضـع القـوانيـن 🏅مـع القـوانين 

🕵‍♀👁‍🗨ضـع الـوصف 🏅مـع وصـف جـديد
 
🕵‍♀👁‍🗨معـلومات المجموعه

🕵‍♀👁‍🗨اعدادات الوسـائط



🕵‍♀🌟مـــ๋͜͡ـہٰٰـطـ✮๋͜͡‏ٰ̲ـِـور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@xOx_tema_xOx

🕵‍♀🌟قـﮧ௸ْْـّٰ̐ہٰٰنــ✮๋͜͡‏ٰ̲ـِـاه الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@nO_No2

🕵‍♀🌟بـﮧ௸ْْـّٰ̐ہٰٰوت تــ✮๋͜͡‏ٰ̲ـِـواصـٰٰٖـٰٰٖہـٰٰٖ͡ـہـل
@k3k44_bOt


]]
------------------------

 elseif  matches[1] == "م المطور" and is_momod(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻   "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
🔥اوامـᎿℌєـر المـⅆỔـطـᵿ₷ـور 🔥

🕵‍♀👁‍🗨 تفعيل 🌟 للتـفعيل البـوت 
🕵‍♀👁‍🗨 تعـطيل🌟 لتعـطيل الـبوت

🕵‍♀👁‍🗨 غادر 🌟لـمغـادره البوت  

🕵‍♀👁‍🗨 اضف مطور 🌟  مع ايدي
🕵‍♀👁‍🗨حـذف مـطـور 🌟 مع ايدي

🕵‍♀👁‍🗨 الملفات  🌟 لعرض ملفات السـورس 
🕵‍♀👁‍🗨 تفعيل ملف 🌟 لتفعيل ملف +اسم 
🕵‍♀👁‍🗨تعطيل ملف 🌟 لتعطيل ملف +اسـم 

🕵‍♀👁‍🗨اذاعه 🌟 للبـث في كروبات

🕵‍♀👁‍🗨 الردود🌟 لعرض الردود 
🕵‍♀👁‍🗨رد اضف 🌟 لاضافه رد 
🕵‍♀👁‍🗨 رد حذف 🌟 لحـذف رد 

🕵‍♀👁‍🗨تنـظيف 1000 🌟 لمسـح رسائل الكـروب

🕵‍♀🌟مـــ๋͜͡ـہٰٰـطـ✮๋͜͡‏ٰ̲ـِـور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@xOx_tema_xOx

🕵‍♀🌟قـﮧ௸ْْـّٰ̐ہٰٰنــ✮๋͜͡‏ٰ̲ـِـاه الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس
@nO_No2

🕵‍♀🌟بـﮧ௸ْْـّٰ̐ہٰٰوت تــ✮๋͜͡‏ٰ̲ـِـواصـٰٰٖـٰٰٖہـٰٰٖ͡ـہـل
@k3k44_bOt

]]
-----------------------

 elseif  matches[1] == "م6" and is_sudo(msg) then 
    return "🎀🎖اهـلا بـك عـزيـزي 😻  "..msg.from.first_name.."\n"
  .."  ".."\n"
  ..[[
  انجـب ابـن نعال ويـن اكـو هيـج 
  ]]
  end
end
return {
  patterns = {
    "^(الاوامر)",
    "^(م1)",
    "^(م2)",
    "^(م3)",
    "^(م4)",
    "^(م المطور)",
    "^(م6)",
    
  },
  run = run
}
end

---by tetoo
-- @l_l_lo