do 
local function run(msg, matches) 
 if is_sudo(msg) then 
   return "  🕵🌟 اهـــ๋͜͡ـہٰٰـلا حﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـضـــ๋͜͡ـہٰٰـرت الــ͡ـ̡ـمــــ๋͜͡ـہٰٰطـــ๋͜͡ــور 🙇 ايــــ๋͜͡ــديـــ๋͜͡ـہٰٰك هــ✮๋͜͡‏ٰ̲ـِـوا 🆔: "..msg.from.id 
 end 
 if is_owner(msg) then 
   return " 🕵🌟 اهـــ๋͜͡ـہٰٰـلا حﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـضـــ๋͜͡ـہٰٰـرت الــ͡ـ̡ــمـــ๋͜͡ــديـــ๋͜͡ـہٰٰر 🙇 ايــــ๋͜͡ــديـــ๋͜͡ـہٰٰك هــ✮๋͜͡‏ٰ̲ـِـوا 🆔: "..msg.from.id 
 end 
 if is_momod(msg) then 
   return " 🕵🌟 اهـــ๋͜͡ـہٰٰـلا حﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـضـــ๋͜͡ـہٰٰـرت الادمــــ๋͜͡ـہٰٰـن🙇 ايــــ๋͜͡ــديـــ๋͜͡ـہٰٰك هــ✮๋͜͡‏ٰ̲ـِـوا 🆔"..msg.from.id 
 end 
 if not is_momod(msg) then 
   return "  🕵🌟 اهـــ๋͜͡ـہٰٰـلا حﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـضـــ๋͜͡ـہٰٰـرت الــ͡ـ̡ــعـــ๋͜͡ـہٰٰضـٰٰٰٰٰٰٰ̲ــو 🙇 ايــــ๋͜͡ــديـــ๋͜͡ـہٰٰك هــ✮๋͜͡‏ٰ̲ـِـوا 🆔: "..msg.from.id 
 end 
end 

return { 
 patterns = { 
   "^[!/#](ايدي)$" 
 }, 
 run = run, 
} 

end
