
do 
function llX8Xll(msg, matches) 
local reply_id = msg['id'] 

local keeper = '🕵‍♀👁‍🗨ايﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـديـــ๋͜͡ــك: '..msg.from.id..'\n'
..'🕵‍♀👁‍🗨 مﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰعہہًّ๋͜͡‏ِــًّ๋͜͡‏ـرفـ✮๋͜͡‏ٰ̲ـِـك •: @'..msg.from.username..'\n'
..' 🕵‍♀👁‍🗨اسﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـم الاولـــ๋͜͡ـہٰٰ •: '..(msg.from.first_name or '')..'\n'
..' 🕵‍♀👁‍🗨 الاســـ๋͜͡ـہٰٰﮧ௸ْْـّٰ̐ہٰٰـم الاخہہًّ๋͜͡‏ِــًّ๋͜͡‏ـيــــ๋͜͡ــر •: '..(msg.from.lastname or "گـبر ماتحـط اسـم 😹"    )..'\n'
..'🕵‍♀👁‍🗨ايﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰدي الـــ๋͜͡ــكہہًّ๋͜͡‏ِــًّ๋͜͡‏ـروب •: '..msg.to.id..'\n'
..' 🕵‍♀👁‍🗨 اســـ๋͜͡ـہٰٰﮧ௸ْْـّٰ̐ہٰٰم الـــ๋͜͡ـہٰٰكہہًّ๋͜͡‏ِــًّ๋͜͡‏ـروب: '..msg.to.title..'\n'
..'🕵‍♀👁‍🗨 رقﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰمہہًّ๋͜͡‏ِــًّ๋͜͡‏ـك •: '..(msg.from.phone or "لا يوجـــد🙁"..'\n'
..'🕵‍♀👁‍🗨 الــــ๋͜͡ــرسﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰالـــ๋͜͡ــه •: '..msg.text..'\n'
..'🕵‍♀👁‍🗨 الﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰوقـ✮๋͜͡‏ٰ̲ـِـت: '..os.date(' %T', os.time()))..'\n'
..' 🕵‍♀👁‍🗨 الﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰتــ͡ـ̡ـاريـ✮๋͜͡‏ٰ̲ـِـخ•: '.. os.date('!%A %B:%d:%Y\n', timestamp)..'\n' 
.."🕵‍♀👁‍🗨 قﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـنہہًّ๋͜͡‏ِــًّ๋͜͡‏ـاه السـ✮๋͜͡‏ٰ̲ـِـورس•  #تيـتو @nO_No2".."\n"
reply_msg(msg.id, keeper, ok_cb, false)

end 

return { 
patterns = { 
"^معلوماتي" 
}, 
run = llX8Xll 
} 

end
