-- made by { @llX8Xll } 
do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "السلام عليكم"
rs[1] = "عﮧ௸ْْـّٰ̐ہٰٰليكـــ๋͜͡ــم الـــ๋͜͡ـہٰٰســـ๋͜͡ــلام🌝🌚"

ws[2] = "هلاو"
rs[2] = "هﮧ௸ْْـّٰ̐ہٰٰلاوات 💋😍"

ws[3] = "هلو"
rs[3] = "هﮧ௸ْْـّٰ̐ہٰٰلاوات 💋😍"

ws[4] = "سلام"
rs[4] = "عﮧ௸ْْـّٰ̐ہٰٰليكـــ๋͜͡ــم الـــ๋͜͡ـہٰٰســـ๋͜͡ــلام🌝🌚"

ws[5] = "شلونك"
rs[5] = "تـﮧ௸ْْـّٰ̐ہٰٰمـــ๋͜͡ـہٰٰام 💚و انـ✮๋͜͡‏ٰ̲ـِـتـہہًّ๋͜͡‏ِــًّ๋͜͡‏ـه 👅💋🌝🍃"

ws[6] = "شلونج"
rs[6] = "تـﮧ௸ْْـّٰ̐ہٰٰمـــ๋͜͡ـہٰٰام 💚و انـ✮๋͜͡‏ٰ̲ـِـتـہہًّ๋͜͡‏ِــًّ๋͜͡‏ـه 👅💋"

ws[7] = "دوم"
rs[7] = "الله يـﮧ௸ْْـّٰ̐ہٰٰديـ✮๋͜͡‏ٰ̲ـِـم انـــ๋͜͡ــفـــ๋͜͡ـہٰٰاســــ๋͜͡ـہٰٰك 💚💋"

ws[8] = "شخباركم"
rs[8] = "♥تـﮧ௸ْْـّٰ̐ہٰٰمـــ๋͜͡ـہٰٰام 💚و انـ✮๋͜͡‏ٰ̲ـِـتـہہًّ๋͜͡‏ِــًّ๋͜͡‏ـه 👅💋️"

ws[9] = "احبك"
rs[9] = "انـﮧ௸ْْـّٰ̐ہٰٰي امــۣۗﮧ✥ٍُـّٰ̐ہٰٰوت بيــ✮๋͜͡‏ٰ̲ـِـك 💋❤️"

ws[10] = "احبج"
rs[10] = "انـﮧ௸ْْـّٰ̐ہٰٰي امــۣۗﮧ✥ٍُـّٰ̐ہٰٰوت بيــ✮๋͜͡‏ٰ̲ـِـك 💋❤️"

ws[11] = "اكلك"
rs[11] = "لاـــ๋͜͡ـہٰٰ تـــ๋͜͡ــكـــ๘ٌ๋ـول😹🍃"

ws[12] = "مرحبا"
rs[12] = "مـــ๋͜͡ـہٰٰـراحـ✮๋͜͡‏ٰ̲ـِــب كـہہًّ๋͜͡‏ِــًّ๋͜͡‏ـبـــ๋͜͡ـــد🍃🌸🎈"

ws[13] = "مرحبه"
rs[13] = "مـــ๋͜͡ـہٰٰـراحـ✮๋͜͡‏ٰ̲ـِــب كـہہًّ๋͜͡‏ِــًّ๋͜͡‏ـبـــ๋͜͡ـــد🍃🌸😻"

ws[14] = "هههه"
rs[14] = "دوووم ضـــ๋͜͡ــحـــ๋͜͡ـہٰٰكــ✮๋͜͡‏ٰ̲ـِـة 🌺🔥😽"

ws[15] = "ههههه"
rs[15] = "دوووم ضـــ๋͜͡ــحـــ๋͜͡ـہٰٰكــ✮๋͜͡‏ٰ̲ـِـة 🌺🔥💋🍃"

ws[16] = "علوش"
rs[16] = "ضـﮧ௸ْْـّٰ̐ہٰٰلـــ๋͜͡ـہٰٰع 💪ابﮧ௸ْْـّٰ̐ہٰٰـو ؏ــــ๋͜͡ـہٰٰســـ๋͜͡ــولـ✮๋͜͡‏ٰ̲ـِـه 💛"

ws[17] = "صباح الخير"
rs[17] = "صـﮧ௸ْْـّٰ̐ہٰٰبـــ๋͜͡ـہٰٰاح الــ✮๋͜͡‏ٰ̲ـِـورد⚡️🌹"

ws[18] = "صباحو"
rs[18] = "صـﮧ௸ْْـّٰ̐ہٰٰبـــ๋͜͡ـہٰٰاح الــ✮๋͜͡‏ٰ̲ـِـورد⚡️🌹"

ws[19] = "انمار"
rs[19] = "هـذا مــــ๋͜͡ـہٰٰطـــ๋͜͡ـــور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس 🌟🌺"

ws[20] = "نموري"
rs[20] = "هـذا مــــ๋͜͡ـہٰٰطـــ๋͜͡ـــور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس 🌟🌺"

ws[21] = "🌚"
rs[21] = "مـــ๋͜͡ـہٰٰنـﮧ௸ْْـّٰ̐ہٰٰور صــ๘ٌ๋ـخـــ๋͜͡ـــام الہہًّ๋͜͡‏ِــًّ๋͜͡‏ـجـــ๋͜͡ـہٰٰـدر ☻😂️"

ws[22] = "ابو عسوله"
rs[22] = "هـذا مــــ๋͜͡ـہٰٰطـــ๋͜͡ـــور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس 🌟🌺"

ws[23] = "ابو عسولة"
rs[23] = "هـذا مــــ๋͜͡ـہٰٰطـــ๋͜͡ـــور الـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـورس 🌟🌺"

ws[24] = "اسعد"
rs[24] = "ضـﮧ௸ْْـّٰ̐ہٰٰلـــ๋͜͡ـہٰٰع 💪ابﮧ௸ْْـّٰ̐ہٰٰـو ؏ــــ๋͜͡ـہٰٰســـ๋͜͡ــولـ✮๋͜͡‏ٰ̲ـِـه 💛"

ws[25] = "يا سورس هذا"
rs[25] = "ســــ๋͜͡ـہٰٰورس ابﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـو عـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـولـ✮๋͜͡‏ٰ̲ـِـه 💛 تـ✮๋͜͡‏ٰ̲ـِـيـــ͡ـ̡ـہٰٰتو"

ws[26] = "هذا يا سورس"
rs[26] = "ســــ๋͜͡ـہٰٰورس ابﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰـو عـــ๋͜͡ـہٰٰسﮧ௸ْْـّٰ̐ہٰٰـولـ✮๋͜͡‏ٰ̲ـِـه 💛 تـ✮๋͜͡‏ٰ̲ـِـيـــ͡ـ̡ـہٰٰتو"

ws[27] = "علي نور"
rs[27] = "ضـﮧ௸ْْـّٰ̐ہٰٰلـــ๋͜͡ـہٰٰع 💪ابﮧ௸ْْـّٰ̐ہٰٰـو ؏ــــ๋͜͡ـہٰٰســـ๋͜͡ــولـ✮๋͜͡‏ٰ̲ـِـه 💛"

ws[28] = "لولو"
rs[28] = "حـبﮧ௸ْْـّٰ̐ہٰٰـيبـــ๋͜͡ـہٰٰت المـــ๋͜͡ـہٰٰـطـــ๋͜͡ــور 🌹🙈"

ws[29] = "لبنى"
rs[29] = "حـبﮧ௸ْْـّٰ̐ہٰٰـيبـــ๋͜͡ـہٰٰت المـــ๋͜͡ـہٰٰـطـــ๋͜͡ــور 🌹🙈"

ws[30] = "ريتاج"
rs[30] = "حـبﮧ௸ْْـّٰ̐ہٰٰـيبـــ๋͜͡ـہٰٰت المـــ๋͜͡ـہٰٰـطـــ๋͜͡ــور 🌹🙈"

ws[31] = "اتفل"
rs[31] = "خخـ﴿😚﴾ـخ تـ﴿💦﴾ـفوو خخـ﴿😚﴾ـخ تـ﴿💦﴾ـفوو خہــ💦ــخــ💦ـــــہٰٰخ تٌـٌـٌـٌ﴿💦﴾ـٌـٌـٌـٌف✟خــ😚ــخــ😚ـخ تــ💦ــفــ💦ــوو خخخخــووــووــووــوو💦💨😚تفــووــو😹😹"

ws[32] = "انجب"
rs[32] = "انﮧ௸ْْـّٰ̐ہٰٰجـــ๋͜͡ــب انــ͡ـ̡ـتـــ๋͜͡ــه يـــ๋͜͡ـہٰٰا خـ✮๋͜͡‏ٰ̲ـِــرا 😭😂"

ws[33] = "بوت"
rs[33] = "لا مـو بــــ๋͜͡ـہٰٰوت نـــ๋͜͡ــعـــ๋͜͡ـہٰٰال رقـ✮๋͜͡‏ٰ̲ـِـم ـــ๋͜͡ـہٰٰـہۧۖۖۗـ₪ۣۗـہـ😂😂😂"
-- the main function
function run( msg, matches ) 
   -- just a local variables that i used in my algorithm 
   local i = 0; local w = false 

   -- the main part that get the message that the user send and check if it equals to one of the words in the ws table :) 
   -- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
   for k,v in pairs(ws) do 
      -- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
      if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then 
         -- assign the { i } to the index of the reply and the { w } to true ( we will use it later ) 
         i = k; w = true; 
      end 
   end 

   -- check if { w } is not false and { i } not equals to 0 
   if ( (w ~= false) and (i ~= 0) ) then 
      -- get the receiver :3 
      R = get_receiver(msg) 
      -- send him the proper message from the index that { i } assigned to 
      --send_large_msg ( R , rs[i] ); 
      --send_reply(msg.id, rs[i]) 
      reply_msg(msg.id, rs[i], ok_cb, false ) 
   end 
   -- don't edit this section 
   if ( msg.text == "about" ) then 
      if ( msg.from.username == "li_xXx_il" ) then 
         R = get_receiver(msg) 
         send_large_msg ( R , "Made by @li_xXx_il" ); 
      end 
   end 

end 

return { 
   patterns = { 
      "(.*)" 
     }, 
     run = run 
} 

end
