
do

function run(msg, matches)
return [[

🕵‍♀👁‍🗨 الــــ๋͜͡ـہٰٰﮧ௸ْْـّٰ̐ہٰٰبوت الـ✮๋͜͡‏ٰ̲ـِـذي يﮧ௸ْْـّٰ̐ہٰٰعـــ๋͜͡ـہٰٰمہہًّ๋͜͡‏ِــًّ๋͜͡‏ـل عـــ๋͜͡ــلـــ๋͜͡ـہٰٰي مـــ๋͜͡ـہٰٰﮧ௸ْْـّٰ̐ہٰٰجـہۧۖۖۗـ₪ۣۗـہـمہٰﹻٰ۪۫ﹻٰٰﹻٰٰوعـــ๋͜͡ـہٰٰات الســﮧ௸ْْـّٰ̐ہٰٰـہۧۖۖۗـ₪ۣۗـہـوبـــ๋͜͡ـہٰٰـر



⌫تــﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰم  صـ✮๋͜͡‏ٰ̲ـِــنـــ๋͜͡ـہٰٰـع الہہًّ๋͜͡‏ِــًّ๋͜͡‏ـبــــ๋͜͡ـــوت بــــ๋͜͡ــواســــ๋͜͡ـہٰٰطـہـْـہٰٰٖ͡ۂـه الﮧ௸ْْـّٰ̐ہٰٰمہہًّ๋͜͡‏ِــًّ๋͜͡‏ـطـــ๋͜͡ـہٰٰور ⌦

🕵‍♀👁‍🗨 ابﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰــو عہہًّ๋͜͡‏ِــًّ๋͜͡‏ـســ✮๋͜͡‏ٰ̲ـِــولـٰٰٖـٰٰٖہ 💛

 ╔ @xOx_tema_xOx ╗

⍅ @k3k44_bOt ⍆

🕵‍♀👁‍🗨 للاسـﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰتہہًّ๋͜͡‏ِــًّ๋͜͡‏ـفســـ๋͜͡ـہٰٰار راسﮧ௸ْْـّٰ̐ہٰٰل الــ͡ـ̡ـمہہًّ๋͜͡‏ِــًّ๋͜͡‏ـطـــ๋͜͡ـہٰٰور
 ☞ @xOx_tema_xOx ☜
🕵‍♀👁‍🗨 تــ✮๋͜͡‏ٰ̲ـِـابﮧ௸ْْـّٰ̐ہٰٰع كــــ๋͜͡ــل مــ͡ـ̡ــاهـــ๋͜͡ـہٰٰـوا جــــ๋͜͡ــديہہًّ๋͜͡‏ِــًّ๋͜͡‏ـد ؏ قﮧ௸ْْـّٰ̐ہٰٰـــ๋͜͡ـہٰٰنـــ๋͜͡ــاه 
【  @No_nO2 】

            
]]
end

return {
description = "Shows bot q", 
usage = "spam Shows bot q",
patterns = {
"^(المطور)$",
},
run = run 
}
end
